BlogProject101/blogger/app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "_xCxuuP2kBGn7SSXNAmy"], ["crypted_password", "$2a$10$BF4dInUr7w8/boRck4t7CumqkQADE.Ei3SneRc3cko4m/kQFXe7Kq"], ["updated_at", "2018-06-02 20:58:47.127063"], ["id", 1]]